[
    {
      "title": "Choosing the Right Database for a Food Delivery Web Application: A Developer's Guide",
      "content": "As a junior software developer, one of the critical decisions you'll make when building a food delivery web application is choosing the right database. This guide will help you understand the factors to consider when selecting a database for your project.",
      "url": "https://medium.com/@sjunaid626/choosing-the-right-database-for-a-food-delivery-web-application-a-developers-guide-a2cf57d1951a",
      "tags": ["database", "web development", "software development"]
    },
    {
      "title": "How to Hack Your Productivity and Achieve More in Less Time",
      "content": "If you're like most people, you probably have a long list of tasks to accomplish. This article provides tips and strategies to enhance your productivity and get more done in less time.",
      "url": "https://medium.com/@sjunaid626/how-to-hack-your-productivity-and-achieve-more-in-less-time-3d600b41735c",
      "tags": ["productivity", "time management", "personal development"]
    },
    {
      "title": "Enhance Your VS Code Experience with These Amazing Features",
      "content": "Visual Studio Code (VS Code) is a popular code editor that supports a wide range of programming languages and extensions. Discover some amazing features that can enhance your coding experience with VS Code.",
      "url": "https://medium.com/@sjunaid626/enhance-your-vs-code-experience-with-these-amazing-extensions-10776642d56e",
      "tags": ["VS Code", "coding", "software development"]
    },
    {
      "title": "How Did I Get Into Software Development?",
      "content": "I have always been fascinated by computers and how they work. Ever since I was a kid, I loved playing video games and tinkering with technology. This article shares my journey into the world of software development.",
      "url": "https://medium.com/@sjunaid626/how-did-i-get-into-software-development-bf794450567f",
      "tags": ["software development", "personal story", "career"]
    }
  ]