[  
  {
  "img": "/images/kudospot.png",
  "title": "Kudospot",
  "desc": "Kudospot is a platform for team members to send and receive badges of appreciation. It features: 1. Sending kudos with badges and messages.2. Viewing analytics and leaderboard. 3. Displaying the most liked post.",
  "techs": [
    "ReactJS",
    "NodeJS",
    "MongoDB",
    "ChartJS",
    "Tailwind CSS"
  ],
  "live": "https://kudospot-ten.vercel.app/",
  "source": "https://github.com/iamsjunaid/kudospot"
  }, 
  {
    "img": "/images/next-blog.png",
    "title": "Next Blog",
    "desc": "Leveraging the power of NextJS & React for building user interfaces and MongoDB for database management. It also uses gray-matter for parsing front-matter from markdown files, react-markdown for rendering markdown content, and react-syntax-highlighter for syntax highlighting in markdown.",
    "techs": [
      "NextJS",
      "ReactJS",
      "MongoDB",
      "Gray-matter",
      "React-markdown",
      "React-syntax-highlighter",
      "Tailwind CSS"
    ],
    "live": "https://next-blogs-zeta-five.vercel.app/",
    "source": "https://github.com/iamsjunaid/next_blogs"
  },  
  {
    "img": "/images/next-events.png",
    "title": "Next Events",
    "desc": "Next Events is a web application that allows users to search for upcoming events in their area. The application allows users to browse events. Users can filter the events based on date and month. The application is built using the Next.js framework. The application is fully responsive and optimized for mobile devices and it is deployed on Vercel.",
    "techs": ["NextJS", "ReactJS", "Vanilla JavaScript", "CSS3"],
    "live": "https://next-events-pi-smoky.vercel.app/events",
    "source": "https://github.com/iamsjunaid/next_events"
  },
  {
    "img": "/images/healthcare-dashboard.png", 
    "title": "Healthcare Dashboard",
    "desc": "This project involves creating a web application to fetch and display patient data securely, including health metrics such as heart rate, respiratory rate, and blood pressure, specifically for a patient named Jessica Taylor. Utilizing Vite for the build process, the project employs environment variables to securely manage sensitive information like.",
    "techs": ["HTML5", "CSS3", "Vanilla JavaScript", "ChartJS", "Adobe XD"],
    "live": "https://healthcare-dashboard.onrender.com/",
    "source": "https://github.com/iamsjunaid/healthcare_dashboard"
  },
  {
    "img": "/images/doc-talk.png",
    "title": "Doc Talk",
    "desc": "A trusted health companion, brings the power of informed conversations to your fingertips. Clear and open communication is the key to better healthcare decisions, and that's what Doctalk is all about.",
    "techs": ["Ruby on Rails", "PostgreSQL", "RSpec", "ReactJS", "Tailwind CSS", "Redux", "React Testing Library"],
    "live": "https://doc-talk2.onrender.com/",
    "source": "https://github.com/iamsjunaid/DocTalk-Frontend"
  },
  {
    "img": "/images/budget-bee.png",
    "title": "Budget Bee",
    "desc": "Take control of your finances with ease and precision. Create personalized budgets tailored to your lifestyle and financial goals. Seamlessly manage your income and expenses by categorizing transactions, giving you a clear overview of your spending habits.",
    "techs": ["Ruby on Rails", "Tailwind CSS", "PostgreSQL", "Rspec"],
    "live": "https://budget-bee.onrender.com/",
    "source": "https://github.com/iamsjunaid/budget-bee"
  },
  {
    "img": "/images/space-travellers-hub.png",
    "title": "Space Travellers Hub",
    "desc": "Leveraging real-time data from the SpaceX API, A user-friendly interface ensures seamless navigation, allowing enthusiasts to choose from a variety of rocket options and participate in thrilling space expeditions.",
    "techs": ["ReactJS", "Redux", "React Testing Library"],
    "live": "https://space-travelers-hub-dhiu.onrender.com/",
    "source": "https://github.com/iamsjunaid/space-travelers-hub"
  },
  {
    "img": "/images/mealsdb.png",
    "title": "Meals DB",
    "desc": "Discover meals tailored to your taste buds and dietary preferences. Engage with the community by liking and commenting on your favorite dishes, sharing your culinary adventures, and learning from fellow food enthusiasts. Want to ensure a seat at the table? Reserve your spot for upcoming events and exclusive chef's specials.",
    "techs": ["HTML", "CSS", "JavaScript-ES6"],
    "live": "https://iamsjunaid.github.io/MealsDB",
    "source": "https://github.com/iamsjunaid/MealsDB"
  }
]
