[  
  {
  "img": "/images/kudospot.png",
  "title": "Kudospot",
  "desc": "Kudospot is a platform designed to foster team collaboration and appreciation. It allows team members to send and receive kudos in the form of badges and personalized messages. The platform includes analytics to view team performance, a leaderboard to track the top contributors, and a section showcasing the most liked posts.",
  "techs": [
    "ReactJS",
    "NodeJS",
    "MongoDB",
    "ChartJS",
    "Tailwind CSS"
  ],
  "live": "https://kudospot-ten.vercel.app/",
  "source": "https://github.com/iamsjunaid/kudospot"
  }, 
  {
    "img": "/images/next-blog.png",
    "title": "Next Blog",
    "desc": "Next Blog is a blog management platform built with modern web technologies. It utilizes Next.js and React for creating dynamic interfaces, while MongoDB handles database management. Key features include parsing front-matter from markdown files using gray-matter, rendering markdown content with react-markdown, and syntax highlighting through react-syntax-highlighter. This platform is ideal for developers and content creators seeking an efficient and elegant way to manage blogs.",
    "techs": [
      "NextJS",
      "ReactJS",
      "MongoDB",
      "Gray-matter",
      "React-markdown",
      "React-syntax-highlighter",
      "Tailwind CSS"
    ],
    "live": "https://next-blogs-zeta-five.vercel.app/",
    "source": "https://github.com/iamsjunaid/next_blogs"
  },  
  {
    "img": "/images/next-events.png",
    "title": "Next Events",
    "desc": "Next Events is a user-friendly platform for discovering upcoming events in your area. Users can browse events, filter them by date or month, and access detailed event information. Built with Next.js, the application is fully responsive, optimized for mobile devices, and deployed on Vercel for reliable performance.",
    "techs": ["NextJS", "ReactJS", "Vanilla JavaScript", "CSS3"],
    "live": "https://next-events-pi-smoky.vercel.app/events",
    "source": "https://github.com/iamsjunaid/next_events"
  },
  {
    "img": "/images/healthcare-dashboard.png", 
    "title": "Healthcare Dashboard",
    "desc": "This web application securely fetches and displays patient health data, including metrics such as heart rate, respiratory rate, and blood pressure. The project features a clean UI and utilizes environment variables to securely manage sensitive information. Built with Vite for an optimized development experience, the dashboard provides an efficient way to monitor patient health in real time.",
    "techs": ["HTML5", "CSS3", "Vanilla JavaScript", "ChartJS", "Adobe XD"],
    "live": "https://healthcare-dashboard.onrender.com/",
    "source": "https://github.com/iamsjunaid/healthcare_dashboard"
  },
  {
    "img": "/images/doc-talk.png",
    "title": "Doc Talk",
    "desc": "Doc Talk is a trusted health companion platform that empowers users to have informed conversations about their health. By focusing on clear communication, Doc Talk helps users to make appointments with doctors. It features a user-friendly design and robust functionality for secure and efficient health data management.",
    "techs": ["Ruby on Rails", "PostgreSQL", "RSpec", "ReactJS", "Tailwind CSS", "Redux", "React Testing Library"],
    "live": "https://doc-talk2.onrender.com/",
    "source": "https://github.com/iamsjunaid/DocTalk-Frontend"
  },
  {
    "img": "/images/budget-bee.png",
    "title": "Budget Bee",
    "desc": "Budget Bee is a personal finance management tool that simplifies budgeting and expense tracking. Users can create customized budgets, categorize transactions, and gain a clear overview of their spending habits. The platform aims to help users take control of their finances with precision and ease.",
    "techs": ["Ruby on Rails", "Tailwind CSS", "PostgreSQL", "Rspec"],
    "live": "https://budget-bee.onrender.com/",
    "source": "https://github.com/iamsjunaid/budget-bee"
  },
  {
    "img": "/images/space-travellers-hub.png",
    "title": "Space Travellers Hub",
    "desc": "Space Travellers Hub is an engaging platform powered by real-time data from the SpaceX API. Users can explore various rocket options, book thrilling space expeditions, and enjoy a user-friendly interface designed for seamless navigation. This project highlights the power of modern web development and interactive design.",
    "techs": ["ReactJS", "Redux", "React Testing Library"],
    "live": "https://space-travelers-hub-dhiu.onrender.com/",
    "source": "https://github.com/iamsjunaid/space-travelers-hub"
  },
  {
    "img": "/images/mealsdb.png",
    "title": "Meals DB",
    "desc": "Meals DB is an interactive platform for discovering dishes tailored to users’ tastes and preferences. Users can like and comment on their favorite meals, connect with the community, and reserve spots for exclusive culinary events. It offers a unique way to explore and share culinary experiences.",
    "techs": ["HTML", "CSS", "JavaScript-ES6"],
    "live": "https://iamsjunaid.github.io/MealsDB",
    "source": "https://github.com/iamsjunaid/MealsDB"
  }
]
